app/views/admin/items/new.html.erb

    <%= f.label :"ジャンル" %>
    <%= f.collection_select :category_id, Category.all, :id, :name, {prompt: "-- 選択してください --"} %>
---
SELECT "categories".* FROM "categories"