app/controllers/admin/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ケーキ"], ["created_at", "2021-10-20 07:23:51.660507"], ["updated_at", "2021-10-20 07:23:51.660507"]]
---
 def create
    @category = Category.new(category_params)
    @category.save

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "クッキー"], ["updated_at", "2021-10-20 07:24:02.945808"], ["id", 1]]
---
  def update
    @category = Category.find(params[:id])
    @category.update(category_params)