app/controllers/admin/customers_controller.rb

SELECT "publics".* FROM "publics"
---
  def index
    @publics = Public.all

SELECT  "publics".* FROM "publics" WHERE "publics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @public = Public.find(params[:id])

SELECT  "publics".* FROM "publics" WHERE "publics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @public = Public.find(params[:id])

SELECT  "publics".* FROM "publics" WHERE "publics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "publics" SET "last_name" = ?, "updated_at" = ? WHERE "publics"."id" = ?  [["last_name", "test"], ["updated_at", "2021-10-21 04:00:13.667767"], ["id", 1]]
---
  def update
    @public = Public.find(params[:id])
    if @public.update(public_params)