app/controllers/admin/items_controller.rb

  def create
    @item = Item.new(item_params)
    @item.save
---
INSERT INTO "items" ("category_id", "name", "explanation", "image_id", "tax_excluded_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @item = Item.find(params[:id])
    @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "explanation" = ?, "sale_status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "16a35339b1fc63c760324153d5be21b887b8839ed87a865706118069843d"], ["explanation", "クッキー"], ["sale_status", 0], ["updated_at", "2021-10-20 07:26:34.247414"], ["id", 1]]