app/controllers/admin/order_items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "order_items" SET "production_status" = ?, "updated_at" = ? WHERE "order_items"."id" = ?  [["production_status", 0], ["updated_at", "2021-10-24 07:29:27.768909"], ["id", 1]]
---
  def update
    @order_item = OrderItem.find(params[:id])
    @order = @order_item.order
    @order_items = @order_item.order.order_items
    @order_item.update(order_item_params)