app/views/admin/orders/index.html.erb

            <td><%= link_to order.created_at, admin_order_path(order.id) %></td>
            <td><%= order.public.last_name %><%= order.public.first_name %></td>
            <td><%= order.order_items.item_quantity %></td>
---
SELECT  "publics".* FROM "publics" WHERE "publics"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "orders".* FROM "orders"
SELECT SUM("order_items"."item_quantity") FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]