app/views/admin/orders/show.html.erb

SELECT  "publics".* FROM "publics" WHERE "publics"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
            <%= link_to admin_customer_path(@order) do %>
              <%= @order.public.last_name %>  <%= @order.public.first_name %>

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            <%= form_with model: @order, url:admin_order_path, local: true do |f| %>
              <%= f.select :order_status, Order.order_statuses.keys.map {|k| [I18n.t("enums.order.order_status.#{k}"), k]} %>

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
---
              <%= form_with model: order_item, url: admin_order_item_path(order_item), local: true do |f| %>
                <td><%= f.select :production_status, OrderItem.production_statuses.keys.map {|k| [I18n.t("enums.order_item.production_status.#{k}"), k]}, selected: order_item.production_status %></td>