app/controllers/public/addresses_controller.rb

  def index
    @address = Address.new
    @addresses = Address.all
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."public_id" = ?  [["public_id", 3]]

  def update
     @address = Address.find(params[:id])
    if @address.update(address_params)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "addresses" SET "postalcode" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["postalcode", "5555"], ["updated_at", "2021-10-21 05:48:38.001146"], ["id", 2]]

  def create
    @address = Address.new(address_params)
    @address.public_id = current_public.id
    if @address.save
---
INSERT INTO "addresses" ("destination", "address", "postalcode", "created_at", "updated_at", "public_id") VALUES (?, ?, ?, ?, ?, ?)  [["destination", ""], ["address", ""], ["postalcode", ""], ["created_at", "2021-10-21 04:55:02.080782"], ["updated_at", "2021-10-21 04:55:02.080782"], ["public_id", 3]]

  def destroy
    address = Address.find(params[:id])
    if address.public_id == current_public.id
      address.destroy
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 1]]