app/controllers/public/cart_items_controller.rb

  def update
    @cart_item = current_public.cart_items.find(params[:id])
    @cart_item.update(cart_item_params)
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."public_id" = ? AND "cart_items"."id" = ? LIMIT ?  [["public_id", 6], ["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "cart_items" SET "cart_quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["cart_quantity", 15], ["updated_at", "2021-10-23 05:27:33.579537"], ["id", 1]]

  def destroy
    @cart_item = current_public.cart_items.find(params[:id])
    @cart_item.destroy
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."public_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["public_id", 6], ["item_id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]

  def create
    @cart_item = current_public.cart_items.new(cart_item_params)
    @cart_item.public_id = current_public.id
    if current_public.cart_items.find_by(item_id: params[:cart_item][:item_id]).present?
      cart_item = current_public.cart_items.find_by(item_id: params[:cart_item][:item_id])
      @cart_quantity = @cart_item.cart_quantity + cart_item.cart_quantity
      cart_item.update(cart_quantity: @cart_quantity)
      redirect_to public_cart_items_url(@cart_item.public)
    elsif
      @cart_item.save
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."public_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["public_id", 6], ["item_id", 2], ["LIMIT", 1]]
UPDATE "cart_items" SET "cart_quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["cart_quantity", 8], ["updated_at", "2021-10-23 03:26:43.684304"], ["id", 1]]
INSERT INTO "cart_items" ("item_id", "cart_quantity", "created_at", "updated_at", "public_id") VALUES (?, ?, ?, ?, ?)  [["item_id", 2], ["cart_quantity", 1], ["created_at", "2021-10-22 15:46:05.738760"], ["updated_at", "2021-10-22 15:46:05.738760"], ["public_id", 6]]

  def destroy_all
    @cart_items = current_public.cart_items
    @cart_items.destroy_all
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 2]]