app/controllers/public/cart_items_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."public_id" = ?  [["public_id", 6]]
---
  def index
    @public = current_public
    @sum = 0
    @items = Item.all