app/controllers/public/customers_controller.rb

  def show
    @public = current_public
    @public = Public.find(params[:id])
---
SELECT  "publics".* FROM "publics" WHERE "publics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def edit
    @public = Public.find(params[:id])
---
SELECT  "publics".* FROM "publics" WHERE "publics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    public = Public.find(params[:id])
    public.update(public_params)
---
SELECT  "publics".* FROM "publics" WHERE "publics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "publics" SET "telephone" = ?, "updated_at" = ? WHERE "publics"."id" = ?  [["telephone", "2325252535999"], ["updated_at", "2021-10-20 02:05:12.304657"], ["id", 1]]

  def unsubscribe
    @public = Public.find(params[:id])
---
SELECT  "publics".* FROM "publics" WHERE "publics"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def withdraw
    @public = Public.find(params[:id])
<<<<<<< HEAD
    @public.update(user_status: true)
---
SELECT  "publics".* FROM "publics" WHERE "publics"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "publics" SET "user_status" = ?, "updated_at" = ? WHERE "publics"."id" = ?  [["user_status", 1], ["updated_at", "2021-10-23 07:23:25.928829"], ["id", 10]]