app/controllers/public/customers_controller.rb

SELECT "publics".* FROM "publics"
---
  def show
    @public = current_public
    @publics = Public.all

SELECT  "publics".* FROM "publics" WHERE "publics"."email" = ? LIMIT ?  [["email", "1"], ["LIMIT", 1]]
---
  def unsubscribe
    @public = Public.find_by(email: params[:public][:email])