app/controllers/public/items_controller.rb

  def index
    @categories = Category.all
    @items = Item.all
    @items = Item.page(params[:page]).per(8)
---
SELECT "items".* FROM "items"
SELECT COUNT(*) FROM "items"

  def show
    @public = current_public
    @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]