app/controllers/public/orders_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."public_id" = ?  [["public_id", 7]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def confirm
    @cart_items = CartItem.where(public_id: @public.id)
    @bill = (@cart_items.map { |cart_item| cart_item.item.tax_excluded_price * cart_item.cart_quantity }.sum * 1.08).floor
    # 現在の住所を使う場合
    if params[:order][:address_number] == '1'
      @order = Order.new(
        public_id: @public.id,
        postalcode: @public.postalcode,
        address: @public.address,
        destination: @public.last_name + @public.first_name,
        pay: params[:order][:pay]
      )
    # 配送先登録した住所を使う場合
    elsif params[:order][:address_number] == '2'
      address = Address.find(params[:order][:registered]) # params[:select]は選択した住所のid

SELECT  1 AS one FROM "cart_items" WHERE "cart_items"."public_id" = ? LIMIT ?  [["public_id", 7], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."public_id" = ?  [["public_id", 7]]
INSERT INTO "orders" ("postage", "bill", "pay", "destination", "address", "postalcode", "created_at", "updated_at", "public_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "orders" ("postage", "bill", "destination", "address", "postalcode", "created_at", "updated_at", "public_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "order_items" ("order_id", "item_id", "item_quantity", "tax_included_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 15], ["item_id", 2], ["item_quantity", 1], ["tax_included_price", 1620], ["created_at", "2021-10-24 06:06:34.075422"], ["updated_at", "2021-10-24 06:06:34.075422"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 2]]
---
  def create
    # カートが空の場合
    if @public.cart_items.blank?
      redirect_to public_cart_items_path and return
    end
    @order = Order.new(order_params)
    @order.order_status=0

    if @order.save
      # 注文商品テーブルのレコードを作成
      @public.cart_items.map do |cart_item|
        OrderItem.create(
          order_id: @order.id,
          item_id: cart_item.item_id,
          item_quantity: cart_item.cart_quantity,
          production_status: 0,
          tax_included_price: (cart_item.item.tax_excluded_price * 1.08).floor
        )
      end
      # カートアイテムを空にする
      @public.cart_items.destroy_all

SELECT  "orders".* FROM "orders" WHERE "orders"."public_id" = ? LIMIT ? OFFSET ?  [["public_id", 4], ["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @orders = current_public.orders.all.page(params[:page]).per(10)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 18]]
---
  def show
    @order = Order.find(params[:id])
    @order_items = OrderItem.where(order_id: @order)