app/controllers/public/sessions_controller.rb

  def public_state
    ## 【処理内容1】 入力されたemailからアカウントを1件取得
    @public = Public.find_by(email: parms[:public][:email])
---
SELECT  "publics".* FROM "publics" WHERE "publics"."email" = ? LIMIT ?  [["email", "aa@aa"], ["LIMIT", 1]]