app/views/public/cart_items/index.html.erb

        <td class="align-middle">
          <% price = (cart.item.price*1.1).round * cart.count %>
---
SELECT "cart_items".* FROM "cart_items"
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]