app/views/public/orders/index.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 18]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        <td class="col-2 border-left-0 border-top-0 border-dark">
          <% OrderItem.where(order_id: order.id).each do |order_item| %>
            <%= Item.find(order_item.item_id).name %></br>

SELECT "orders".* FROM "orders" WHERE "orders"."public_id" = ?  [["public_id", 7]]
---
        <td class="col-1 border-left-0 border-top-0 border-dark"><%= order.bill.to_s(:delimited) %></td>
        <td class="col-1 border-left-0 border-top-0 border-dark"><%= order.order_status_i18n %></td>