app/views/public/orders/new.html.erb

            <%= "ご自身の住所" %>
            <%= "〒#{current_public.postalcode} #{current_public.address} #{current_public.last_name} #{current_public.first_name}" %>
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."public_id" = ?  [["public_id", 7]]