app/views/public/orders/show.html.erb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
          <tr class="row">
            <td class="col-8 border-top-0 border-dark"><%= Item.find(order_item.item_id).name %></td>

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
            <td class="col-1 border-left-0 border-top-0 border-dark"><%= order_item.item_quantity %></td>
            <td class="col-1 border-left-0 border-top-0 border-dark"><%= ((Item.find(order_item.item_id).tax_excluded_price)*(order_item.item_quantity)).to_s(:delimited) %></td>